# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [3]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [4]:
user_id = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', ('|'))

### Step 4. See the first 25 entries

In [67]:
user_id['age']

0      24
1      53
2      23
3      24
4      33
5      42
6      57
7      36
8      29
9      53
10     39
11     28
12     47
13     45
14     49
15     21
16     30
17     35
18     40
19     42
20     26
21     25
22     30
23     21
24     39
25     49
26     40
27     32
28     41
29      7
       ..
913    44
914    50
915    27
916    22
917    40
918    25
919    30
920    20
921    29
922    21
923    29
924    18
925    49
926    23
927    21
928    44
929    28
930    60
931    58
932    28
933    61
934    42
935    24
936    48
937    38
938    26
939    32
940    20
941    48
942    22
Name: age, Length: 943, dtype: int64

### Step 5. See the last 10 entries

In [6]:
user_id.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [10]:
user_id.shape[0]

943

### Step 7. What is the number of columns in the dataset?

In [13]:
len(user_id.columns)

5

### Step 8. Print the name of all the columns.

In [14]:
user_id.columns

Index([u'user_id', u'age', u'gender', u'occupation', u'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [15]:
user_id.index

RangeIndex(start=0, stop=943, step=1)

### Step 10. What is the data type of each column?

In [16]:
user_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB

### Step 11. Print only the occupation column

In [18]:
user_id['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

### Step 12. How many different occupations are in this dataset?

In [20]:
x = user_id['occupation'].unique()
len(x)

21

### Step 13. What is the most frequent occupation?

In [36]:
user_id['occupation'].value_counts().idxmax()

'student'

### Step 14. Summarize the DataFrame.

In [37]:
user_id.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### Step 15. Summarize all the columns

In [49]:
user_id.describe(include='all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [50]:
user_id['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [52]:
user_id['age'].mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [74]:
user_id['age'].min()

7